{
  "appConfigsExists": "Esta aplicación ya existe. Por favor, elige un nombre o configuración diferente.",
  "appConfigsNameExists": "Lo siento, una aplicación con este nombre ya está en uso. Considera usar un nombre diferente.",
  "appConfigsNotFound": "No se pudo encontrar la aplicación especificada. Asegúrate de que los detalles sean correctos.",
  "customersSquareIdNotFound": "Tu cuenta no tiene un ID de Square asociado. Actualiza los detalles de tu cuenta.",
  "locationsMainNotFound": "La tienda no ha especificado una ubicación principal. Contacta a la tienda para obtener asistencia.",
  "locationsNotFound": "No pudimos encontrar una ubicación coincidente para tu pedido. Verifica tu entrada.",
  "locationsPickupInPast": "Se seleccionó una hora de recogida no válida. Asegúrate de que tu hora de recogida esté programada para el futuro.",
  "locationsPickupOutsideBusinessHours": "La hora de recogida seleccionada está fuera del horario de funcionamiento de la tienda. Elige una hora dentro del horario de trabajo.",
  "locationsPickupTooFarInFuture": "La recogida solo se puede programar con hasta 7 días de anticipación.",
  "locationsSquareIdNotFound": "Esta ubicación aún no ha configurado su ID de Square. Vuelve más tarde o comunícate con la ubicación.",
  "locationsTimezoneNotFound": "No podemos determinar la zona horaria de esta ubicación. Es mejor contactar directamente con la tienda.",
  "merchantsExists": "Un comerciante con esta configuración ya existe.",
  "merchantsNeedsCatalog": "El comerciante requiere un catálogo para acciones futuras.",
  "merchantsNotFound": "Lo sentimos, no pudimos encontrar la tienda especificada. Verifica tu información e intenta nuevamente.",
  "merchantsSquareAccessTokenNotFound": "La tienda no ha configurado el acceso a Square. Vuelve más tarde o contacta con la tienda.",
  "merchantsSquareIdNotFound": "Esta tienda aún no ha configurado su ID de Square.",
  "merchantsStripeIdNotFound": "El comerciante necesita configurar su ID de Stripe.",
  "ordersExists": "Duplicación de pedidos detectada. Este pedido ya está en nuestro sistema.",
  "ordersNotFound": "No pudimos encontrar el pedido especificado. Verifica tus detalles e intenta nuevamente.",
  "ordersSquareIdNotFound": "Parece que a tu pedido le falta el ID de Square asociado. Contacta con nuestro equipo de soporte para obtener ayuda.",
  "squareInvalidResponse": "Hubo un problema al procesar con Square. Por favor, intenta nuevamente más tarde.",
  "stripeInvalidResponse": "Encontramos un problema con Stripe. Por favor, intenta nuevamente después de un tiempo."
}
