{
  "appConfigsExists": "Cette application existe déjà. Veuillez choisir un autre nom ou configuration.",
  "appConfigsNameExists": "Désolé, une application avec ce nom est déjà utilisée. Envisagez d'utiliser un autre nom.",
  "appConfigsNotFound": "Impossible de trouver l'application spécifiée. Assurez-vous que les détails sont corrects.",
  "customersSquareIdNotFound": "Votre compte n'a pas d'ID Square associé. Mettez à jour vos détails de compte.",
  "locationsMainNotFound": "Le magasin n'a pas spécifié d'emplacement principal. Contactez le magasin pour obtenir de l'aide.",
  "locationsNotFound": "Nous n'avons pas pu trouver un emplacement correspondant à votre commande. Vérifiez votre saisie.",
  "locationsPickupInPast": "Heure de ramassage invalide sélectionnée. Assurez-vous que votre heure de ramassage est fixée pour le futur.",
  "locationsPickupOutsideBusinessHours": "L'heure de ramassage choisie est en dehors des heures d'ouverture du magasin. Choisissez une heure pendant les heures d'ouverture.",
  "locationsPickupTooFarInFuture": "Le ramassage ne peut être programmé que jusqu'à 7 jours à l'avance.",
  "locationsSquareIdNotFound": "Cet emplacement n'a pas encore configuré son ID Square. Revenez plus tard ou contactez l'emplacement.",
  "locationsTimezoneNotFound": "Nous ne sommes pas en mesure de déterminer le fuseau horaire de cet emplacement. Il est préférable de contacter directement le magasin.",
  "merchantsExists": "Un commerçant avec cette configuration existe déjà.",
  "merchantsNeedsCatalog": "Le commerçant a besoin d'un catalogue pour d'autres actions.",
  "merchantsNotFound": "Désolé, nous n'avons pas pu trouver le magasin spécifié. Vérifiez vos informations et réessayez.",
  "merchantsSquareAccessTokenNotFound": "Le magasin n'a pas configuré l'accès à Square. Revenez plus tard ou contactez le magasin.",
  "merchantsSquareIdNotFound": "Ce magasin n'a pas encore configuré son ID Square.",
  "merchantsStripeIdNotFound": "Le commerçant doit configurer son ID Stripe.",
  "ordersExists": "Duplication de commande détectée. Cette commande est déjà dans notre système.",
  "ordersNotFound": "Nous n'avons pas pu localiser la commande spécifiée. Vérifiez vos détails et réessayez.",
  "ordersSquareIdNotFound": "Il semble que votre commande n'ait pas d'ID Square associé. Contactez notre équipe de support pour de l'aide.",
  "squareInvalidResponse": "Il y a eu un problème lors du traitement avec Square. Veuillez réessayer plus tard.",
  "stripeInvalidResponse": "Nous avons rencontré un problème avec Stripe. Veuillez réessayer dans un moment."
}
