{
  "appConfigsExists": "Cette application existe déjà. Veuillez choisir un autre nom ou configuration.",
  "appConfigsNameExists": "Désolé, une application avec ce nom est déjà utilisée. Envisagez d'utiliser un autre nom.",
  "appConfigsNotFound": "Impossible de trouver l'application spécifiée. Assurez-vous que les détails sont corrects.",
  "catalogsNotFound": "Impossible de trouver le catalogue spécifié. Veuillez vérifier vos informations.",
  "customersExists": "Un client avec ces détails existe déjà. Envisagez d'utiliser un autre nom ou de mettre à jour les informations.",
  "customersNotFound": "Impossible de localiser le client spécifié. Vérifiez et réessayez.",
  "customersSquareIdNotFound": "Votre compte n'a pas d'ID Square associé. Mettez à jour vos détails de compte.",
  "fileNotFound": "La demande ne contenait pas de fichier. Veuillez en joindre un et réessayer.",
  "idNotFound": "L'ID spécifié n'a pas été trouvé. Assurez-vous que les détails sont corrects.",
  "itemsNotFound": "Aucun article avec l'ID spécifié n'a été trouvé.",
  "locationsBusinessHoursNotFound": "Les heures d'ouverture de cet emplacement ne sont pas disponibles. Veuillez contacter le magasin pour connaître les horaires exacts.",
  "locationsMainNotFound": "Le magasin n'a pas spécifié d'emplacement principal. Contactez le magasin pour obtenir de l'aide.",
  "locationsNotFound": "Nous n'avons pas pu trouver un emplacement correspondant à votre commande. Vérifiez votre saisie.",
  "locationsPickupInPast": "Heure de ramassage invalide sélectionnée. Assurez-vous que votre heure de ramassage est fixée pour le futur.",
  "locationsPickupOutsideBusinessHours": "L'heure de ramassage choisie est en dehors des heures d'ouverture du magasin. Choisissez une heure pendant les heures d'ouverture.",
  "locationsPickupTooFarInFuture": "Le ramassage ne peut être programmé que jusqu'à 7 jours à l'avance.",
  "locationsSquareIdNotFound": "Cet emplacement n'a pas encore configuré son ID Square. Revenez plus tard ou contactez l'emplacement.",
  "locationsTimezoneNotFound": "Nous ne sommes pas en mesure de déterminer le fuseau horaire de cet emplacement. Il est préférable de contacter directement le magasin.",
  "merchantIdOrPathRequired": "Veuillez fournir un ID de marchand ou un chemin valide pour continuer.",
  "merchantsExists": "Un commerçant avec cette configuration existe déjà.",
  "merchantsNeedsCatalog": "Le commerçant a besoin d'un catalogue pour d'autres actions.",
  "merchantsNotFound": "Désolé, nous n'avons pas pu trouver le magasin spécifié. Vérifiez vos informations et réessayez.",
  "merchantsSquareAccessTokenNotFound": "Le magasin n'a pas configuré l'accès à Square. Revenez plus tard ou contactez le magasin.",
  "merchantsSquareIdNotFound": "Ce magasin n'a pas encore configuré son ID Square.",
  "merchantsStripeIdNotFound": "Le commerçant doit configurer son ID Stripe.",
  "merchantsTierNotFound": "Le commerçant n'a pas encore choisi de plan. Par conséquent, nous ne pouvons pas déterminer les frais d'application pour cette commande.",
  "ordersExists": "Duplication de commande détectée. Cette commande est déjà dans notre système.",
  "ordersNotFound": "Nous n'avons pas pu localiser la commande spécifiée. Vérifiez vos détails et réessayez.",
  "ordersSquareIdNotFound": "Il semble que votre commande n'ait pas d'ID Square associé. Contactez notre équipe de support pour de l'aide.",
  "paginationIsNaN": "Le numéro de page doit être une valeur numérique valide.",
  "squareIdNotFound": "L'ID Square requis est manquant. Impossible de traiter votre demande pour le moment.",
  "squareInvalidResponse": "Il y a eu un problème lors du traitement avec Square. Veuillez réessayer plus tard.",
  "stripeInvalidResponse": "Nous avons rencontré un problème avec Stripe. Veuillez réessayer dans un moment.",
  "userTypeInvalid": "Le type d'utilisateur sélectionné n'est pas valide. Choisissez un type valide et poursuivez.",
  "usersNotFound": "Authentification réussie, mais les détails de l'utilisateur ne sont pas disponibles. Veuillez réessayer."
}
