{
  "appConfigsExists": "This app already exists. Please choose a different name or configuration.",
  "appConfigsNameExists": "Sorry, an app with this name is already in use. Consider using a different name.",
  "appConfigsNotFound": "Unable to find the specified app. Please ensure the details are correct.",
  "catalogsNotFound": "Unable to locate the specified catalog. Please verify your details.",
  "customersExists": "A customer with these details already exists. Consider using a different name or updating the information.",
  "customersNotFound": "Unable to locate the specified customer. Double-check and try again.",
  "customersSquareIdNotFound": "Your account does not have an associated Square ID. Update your account details.",
  "fileNotFound": "The request did not contain a file. Please attach one and try again.",
  "idNotFound": "The specified ID was not found. Please ensure the details are correct.",
  "itemsNotFound": "No item with the specified ID was found.",
  "locationsBusinessHoursNotFound": "We're unable to determine the business hours for this location. It's best to contact the store directly.",
  "locationsMainNotFound": "The store hasn't specified a primary location. Contact the store for assistance.",
  "locationsNotFound": "We couldn't locate a matching location for your order. Double-check your entry.",
  "locationsPickupInPast": "Invalid pickup time selected. Ensure your pickup time is set for the future.",
  "locationsPickupOutsideBusinessHours": "The selected pickup time is outside the store's operating hours. Choose a time within business hours.",
  "locationsPickupTooFarInFuture": "Pickup can only be scheduled up to 7 days in advance.",
  "locationsSquareIdNotFound": "This location is yet to configure its Square ID. Check back later or reach out to the location.",
  "locationsTimezoneNotFound": "We're unable to determine the timezone for this location. It's best to contact the store directly.",
  "merchantIdOrPathRequired": "Please provide either a Merchant ID or a valid path to proceed.",
  "merchantsExists": "A merchant with this configuration already exists.",
  "merchantsNeedsCatalog": "The merchant requires a catalog for further actions.",
  "merchantsNotFound": "Sorry, we couldn't find the specified store. Kindly verify your information and try again.",
  "merchantsSquareAccessTokenNotFound": "The store has not configured Square access. Check back later or contact the store.",
  "merchantsSquareIdNotFound": "This store is yet to configure its Square ID.",
  "merchantsStripeIdNotFound": "Merchant needs to set up their Stripe ID.",
  "merchantsTierNotFound": "The merchant has not selected a plan yet. As a result, we can't determine the app fee for this order.",
  "ordersExists": "Order duplication detected. This order is already in our system.",
  "ordersNotFound": "We couldn't locate the specified order. Verify your details and try again.",
  "ordersSquareIdNotFound": "Your order seems to be missing its associated Square ID. Reach out to our support team for help.",
  "paginationIsNaN": "Page number should be a valid numeric value.",
  "squareIdNotFound": "A needed Square ID was not found and we can therefore not process your request.",
  "squareInvalidResponse": "There was an issue processing with Square. Please attempt again later.",
  "stripeInvalidResponse": "We encountered an issue with Stripe. Kindly retry after some time.",
  "userTypeInvalid": "Selected user type is invalid. Choose a valid type and proceed.",
  "usersNotFound": "Successfully authenticated, but the user details are unavailable. Please try again."
}
