{
  "appConfigsExists": "このアプリは既に存在します。異なる名前または設定を選択してください。",
  "appConfigsNameExists": "申し訳ございません、この名前のアプリは既に使用されています。別の名前を検討してください。",
  "appConfigsNotFound": "指定されたアプリを見つけることができませんでした。詳細が正しいことを確認してください。",
  "catalogsNotFound": "指定されたカタログが見つかりません。詳細を確認してください。",
  "customersExists": "これらの詳細を持つ顧客がすでに存在します。異なる名前を使用するか、情報を更新を検討してください。",
  "customersNotFound": "指定された顧客を見つけることができませんでした。再度確認して、お試しください。",
  "customersSquareIdNotFound": "あなたのアカウントには関連するSquare IDがありません。アカウントの詳細を更新してください。",
  "fileNotFound": "リクエストにファイルが含まれていませんでした。ファイルを添付して、再度お試しください。",
  "idNotFound": "指定されたIDは見つかりませんでした。詳細が正しいことを確認してください。",
  "itemsNotFound": "指定されたIDのアイテムは見つかりませんでした。",
  "locationsBusinessHoursNotFound": "この場所の営業時間は利用できません。正確な時間のために店舗に問い合わせてください。",
  "locationsMainNotFound": "店舗は主要な場所を指定していません。助けを求めるために店舗に連絡してください。",
  "locationsNotEnabled": "この場所は現在アクティブではありません。別の場所を選択するか、店舗に連絡してサポートを受けてください。",
  "locationsNotFound": "あなたの注文に一致する場所を見つけることができませんでした。入力を再確認してください。",
  "locationsPickupInPast": "無効な受け取り時間が選択されました。受け取り時間が未来であることを確認してください。",
  "locationsPickupOutsideBusinessHours": "選択された受け取り時間は店舗の営業時間外です。営業時間内での時間を選択してください。",
  "locationsPickupTooFarInFuture": "受け取りは、最大7日先までしか予定できません。",
  "locationsSquareIdNotFound": "この場所はまだSquare IDを設定していません。後で確認するか、場所に問い合わせてください。",
  "locationsTimezoneNotFound": "この場所のタイムゾーンを決定することができません。直接店舗に連絡することをおすすめします。",
  "merchantIdOrPathRequired": "進行するには、マーチャントIDまたは有効なパスを提供してください。",
  "merchantsExists": "この設定を持つ業者は既に存在します。",
  "merchantsNeedsCatalog": "業者はさらなるアクションのためにカタログを必要とします。",
  "merchantsNotEnabled": "この店舗の注文は一時的に一時停止されています。後でもう一度確認してください。",
  "merchantsNotFound": "申し訳ございません、指定された店を見つけることができませんでした。情報を確認して再試行してください。",
  "merchantsSquareAccessTokenNotFound": "店舗はSquareへのアクセスを設定していません。後で確認するか、店舗に連絡してください。",
  "merchantsSquareIdNotFound": "この店はまだSquare IDを設定していません。",
  "merchantsStripeIdNotFound": "業者はStripe IDを設定する必要があります。",
  "merchantsTierNotFound": "商人がまだプランを選択していないため、この注文のアプリ料金を決定できません。",
  "ordersExists": "注文の重複が検出されました。この注文は既に私たちのシステムに存在します。",
  "ordersNotFound": "指定された注文を見つけることができませんでした。詳細を確認して再試行してください。",
  "ordersSquareIdNotFound": "あなたの注文は関連するSquare IDを欠いているようです。サポートチームに連絡して助けを求めてください。",
  "paginationIsNaN": "ページ番号は有効な数値である必要があります。",
  "squareIdNotFound": "必要なSquare IDが見つかりません。現在、あなたの要求を処理することはできません。",
  "squareInvalidResponse": "Squareでの処理中に問題が発生しました。後で再試行してください。",
  "stripeInvalidResponse": "Stripeで問題が発生しました。少し時間をおいてから再試行してください。",
  "userTypeInvalid": "選択されたユーザータイプは無効です。有効なタイプを選択して進めてください。",
  "usersNotFound": "認証に成功しましたが、ユーザーの詳細が利用できません。再度お試しください。"
}
